---
kind: property
id: P:Autodesk.Revit.UI.AddInCommandBinding.RevitCommandId
source: html/1554b0b2-ca81-eae5-1736-f2f3cd6868ab.htm
---
# Autodesk.Revit.UI.AddInCommandBinding.RevitCommandId Property

The Revit command Id.

## Syntax (C#)
```csharp
public RevitCommandId RevitCommandId { get; }
```